In [38]:
# Import modules
import pandas as pd
import matplotlib.pyplot as plt
# import seaborn as sns
import re
import numpy as np
from sklearn import tree
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import GridSearchCV

# Figures inline and set visualization style
%matplotlib inline
# sns.set()

In [39]:
# Import data
df_train = pd.read_csv('/home/gajendra/Github/MachineLearning_intro/Titanic_data/train.csv')
df_test = pd.read_csv('/home/gajendra/Github/MachineLearning_intro/Titanic_data/test.csv')

In [40]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [41]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [42]:
# Store target variable of training data in a safe place
survived_train = df_train.Survived

# Concatenate training and test sets
data = pd.concat([df_train.drop(['Survived'], axis=1), df_test])

data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    1309 non-null int64
Pclass         1309 non-null int64
Name           1309 non-null object
Sex            1309 non-null object
Age            1046 non-null float64
SibSp          1309 non-null int64
Parch          1309 non-null int64
Ticket         1309 non-null object
Fare           1308 non-null float64
Cabin          295 non-null object
Embarked       1307 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 122.7+ KB

In [43]:
# Impute missing numerical variables
data['Age'] = data.Age.fillna(data.Age.median())
data['Fare'] = data.Fare.fillna(data.Fare.median())

# Check out info of data
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    1309 non-null int64
Pclass         1309 non-null int64
Name           1309 non-null object
Sex            1309 non-null object
Age            1309 non-null float64
SibSp          1309 non-null int64
Parch          1309 non-null int64
Ticket         1309 non-null object
Fare           1309 non-null float64
Cabin          295 non-null object
Embarked       1307 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 122.7+ KB

In [44]:
data=data.drop("Cabin", axis=1)
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 10 columns):
PassengerId    1309 non-null int64
Pclass         1309 non-null int64
Name           1309 non-null object
Sex            1309 non-null object
Age            1309 non-null float64
SibSp          1309 non-null int64
Parch          1309 non-null int64
Ticket         1309 non-null object
Fare           1309 non-null float64
Embarked       1307 non-null object
dtypes: float64(2), int64(4), object(4)
memory usage: 112.5+ KB

In [45]:
object_columns_df = data.select_dtypes(include=['object'])
print(object_columns_df.iloc[0])

Name        Braund, Mr. Owen Harris
Sex                            male
Ticket                    A/5 21171
Embarked                          S
Name: 0, dtype: object

In [46]:
object_columns_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 4 columns):
Name        1309 non-null object
Sex         1309 non-null object
Ticket      1309 non-null object
Embarked    1307 non-null object
dtypes: object(4)
memory usage: 51.1+ KB

In [47]:
cols = ['Name', 'Sex','Ticket', 'Embarked']
for name in cols:
    print(name,':')
    print(object_columns_df[name].value_counts(),'\n')

Name :
Kelly, Mr. James                                           2
Connolly, Miss. Kate                                       2
Johnson, Mr. Alfred                                        1
Moutal, Mr. Rahamin Haim                                   1
Hays, Miss. Margaret Bechstein                             1
Kalvik, Mr. Johannes Halvorsen                             1
Silverthorne, Mr. Spencer Victor                           1
Hassab, Mr. Hammad                                         1
Lennon, Mr. Denis                                          1
Fischer, Mr. Eberhard Thelander                            1
McCarthy, Miss. Catherine Katie""                          1
Baclini, Miss. Eugenie                                     1
Smith, Mr. James Clinch                                    1
Becker, Miss. Ruth Elizabeth                               1
Rheims, Mr. George Alexander Lucien                        1
Markun, Mr. Johann                                         1
Coutts, Master. Eden Leslie "Neville"                      1
Brocklebank, Mr. William Alfred                            1
Davison, Mr. Thomas Henry                                  1
Ekstrom, Mr. Johan                                         1
Harper, Miss. Annie Jessie "Nina"                          1
Gillespie, Mr. William Henry                               1
Anderson, Mr. Harry                                        1
Sweet, Mr. George Frederick                                1
Farthing, Mr. John                                         1
Pedersen, Mr. Olaf                                         1
Givard, Mr. Hans Kristensen                                1
Moraweck, Dr. Ernest                                       1
Laroche, Miss. Simonne Marie Anne Andree                   1
Connors, Mr. Patrick                                       1
                                                          ..
Widener, Mr. George Dunton                                 1
LeRoy, Miss. Bertha                                        1
West, Mr. Edwy Arthur                                      1
Daniels, Miss. Sarah                                       1
Lobb, Mr. William Arthur                                   1
Williams, Mr. Richard Norris II                            1
Simonius-Blumer, Col. Oberst Alfons                        1
Peacock, Mrs. Benjamin (Edith Nile)                        1
Vander Planke, Mrs. Julius (Emelia Maria Vandemoortele)    1
Jarvis, Mr. John Denzil                                    1
Duran y More, Miss. Florentina                             1
Lindeberg-Lind, Mr. Erik Gustaf (Mr Edward Lingrey")"      1
Pasic, Mr. Jakob                                           1
Moran, Mr. James                                           1
Duran y More, Miss. Asuncion                               1
Khalil, Mr. Betros                                         1
Schabert, Mrs. Paul (Emma Mock)                            1
Davies, Mr. John Samuel                                    1
Holm, Mr. John Fredrik Alexander                           1
Riihivouri, Miss. Susanna Juhantytar Sanni""               1
Keane, Miss. Nora A                                        1
Beckwith, Mr. Richard Leonard                              1
Adams, Mr. John                                            1
Shine, Miss. Ellen Natalia                                 1
Lemore, Mrs. (Amelia Milley)                               1
Maioni, Miss. Roberta                                      1
Pengelly, Mr. Frederick William                            1
Dorking, Mr. Edward Arthur                                 1
Fahlstrom, Mr. Arne Jonas                                  1
Brown, Mr. Thomas William Solomon                          1
Name: Name, Length: 1307, dtype: int64

Sex :
male      843
female    466
Name: Sex, dtype: int64

Ticket :
CA. 2343              11
CA 2144                8
1601                   8
3101295                7
347082                 7
PC 17608               7
S.O.C. 14879           7
347077                 7
382652                 6
113781                 6
19950                  6
347088                 6
PC 17757               5
W./C. 6608             5
16966                  5
113503                 5
4133                   5
349909                 5
220845                 5
24160                  4
2666                   4
PC 17760               4
C.A. 34651             4
C.A. 33112             4
SC/Paris 2123          4
PC 17483               4
W./C. 6607             4
LINE                   4
230136                 4
C.A. 2315              4
                      ..
112051                 1
350035                 1
A/5 21174              1
PC 17612               1
A/5. 13032             1
350052                 1
C.A. 17248             1
349212                 1
PC 17605               1
239059                 1
345364                 1
SOTON/O.Q. 3101262     1
SC/PARIS 2131          1
347067                 1
111428                 1
STON/O 2. 3101292      1
370370                 1
349249                 1
349221                 1
347070                 1
349231                 1
2682                   1
2687                   1
S.W./PP 752            1
334912                 1
STON/O2. 3101290       1
248698                 1
STON/O 2. 3101273      1
STON/O 2. 3101289      1
364511                 1
Name: Ticket, Length: 929, dtype: int64

Embarked :
S    914
C    270
Q    123
Name: Embarked, dtype: int64

In [48]:
drop_cols=['Name', 'Ticket']
data=data.drop(drop_cols, axis=1)

In [49]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 8 columns):
PassengerId    1309 non-null int64
Pclass         1309 non-null int64
Sex            1309 non-null object
Age            1309 non-null float64
SibSp          1309 non-null int64
Parch          1309 non-null int64
Fare           1309 non-null float64
Embarked       1307 non-null object
dtypes: float64(2), int64(4), object(2)
memory usage: 92.0+ KB

In [50]:
nominal_columns = ["Embarked", "Sex"]
dummy_df = pd.get_dummies(data[nominal_columns])
data = pd.concat([data, dummy_df], axis=1)
data = data.drop(nominal_columns, axis=1)

In [51]:
data.head()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S,Sex_female,Sex_male
0,1,3,22.0,1,0,7.2500,0,0,1,0,1
1,2,1,38.0,1,0,71.2833,1,0,0,1,0
2,3,3,26.0,0,0,7.9250,0,0,1,1,0
3,4,1,35.0,1,0,53.1000,0,0,1,1,0
4,5,3,35.0,0,0,8.0500,0,0,1,0,1

In [52]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    1309 non-null int64
Pclass         1309 non-null int64
Age            1309 non-null float64
SibSp          1309 non-null int64
Parch          1309 non-null int64
Fare           1309 non-null float64
Embarked_C     1309 non-null uint8
Embarked_Q     1309 non-null uint8
Embarked_S     1309 non-null uint8
Sex_female     1309 non-null uint8
Sex_male       1309 non-null uint8
dtypes: float64(2), int64(4), uint8(5)
memory usage: 78.0 KB

In [53]:
data=data.drop(['Sex_female'], axis=1)

In [54]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 10 columns):
PassengerId    1309 non-null int64
Pclass         1309 non-null int64
Age            1309 non-null float64
SibSp          1309 non-null int64
Parch          1309 non-null int64
Fare           1309 non-null float64
Embarked_C     1309 non-null uint8
Embarked_Q     1309 non-null uint8
Embarked_S     1309 non-null uint8
Sex_male       1309 non-null uint8
dtypes: float64(2), int64(4), uint8(4)
memory usage: 76.7 KB

In [55]:
for name in data:
    print(name,':')
    print(data[name].value_counts(),'\n')

PassengerId :
1309    1
449     1
431     1
432     1
433     1
434     1
435     1
436     1
437     1
438     1
439     1
440     1
441     1
442     1
443     1
444     1
445     1
446     1
447     1
430     1
429     1
428     1
418     1
411     1
412     1
413     1
414     1
415     1
416     1
417     1
       ..
890     1
880     1
891     1
892     1
893     1
894     1
895     1
896     1
897     1
881     1
879     1
861     1
869     1
862     1
863     1
864     1
865     1
866     1
867     1
868     1
870     1
878     1
871     1
872     1
873     1
874     1
875     1
876     1
877     1
1       1
Name: PassengerId, Length: 1309, dtype: int64

Pclass :
3    709
1    323
2    277
Name: Pclass, dtype: int64

Age :
28.00    295
24.00     47
22.00     43
21.00     41
30.00     40
18.00     39
25.00     34
36.00     31
26.00     30
29.00     30
27.00     30
19.00     29
23.00     26
32.00     24
20.00     23
35.00     23
31.00     23
33.00     21
45.00     21
17.00     20
39.00     20
16.00     19
42.00     18
40.00     18
34.00     16
50.00     15
38.00     14
47.00     14
48.00     14
2.00      12
        ...
12.00      3
65.00      3
0.83       3
34.50      2
71.00      2
0.92       2
30.50      2
70.00      2
45.50      2
36.50      2
14.50      2
23.50      1
38.50      1
67.00      1
60.50      1
55.50      1
0.17       1
0.33       1
20.50      1
24.50      1
66.00      1
0.42       1
70.50      1
11.50      1
26.50      1
76.00      1
22.50      1
74.00      1
80.00      1
0.67       1
Name: Age, Length: 98, dtype: int64

SibSp :
0    891
1    319
2     42
4     22
3     20
8      9
5      6
Name: SibSp, dtype: int64

Parch :
0    1002
1     170
2     113
3       8
5       6
4       6
9       2
6       2
Name: Parch, dtype: int64

Fare :
8.0500     60
13.0000    59
7.7500     55
26.0000    50
7.8958     49
10.5000    35
7.7750     26
7.2292     24
7.9250     23
26.5500    22
8.6625     21
7.8542     21
7.2250     21
7.2500     18
0.0000     17
21.0000    14
9.5000     12
16.1000    12
14.5000    11
14.4542    11
69.5500    11
27.7208    11
7.7958     10
7.8792     10
15.5000    10
24.1500     9
15.2458     9
7.0500      9
56.4958     8
46.9000     8
           ..
45.5000     1
8.4333      1
8.1583      1
8.0292      1
12.7375     1
31.6833     1
42.5000     1
34.0208     1
25.9250     1
12.6500     1
7.0458      1
49.5000     1
7.7208      1
32.3208     1
6.4500      1
8.3000      1
7.5208      1
28.7125     1
25.5875     1
7.7292      1
9.8458      1
8.6542      1
25.7000     1
10.1708     1
7.3125      1
33.5000     1
7.8000      1
26.3875     1
15.5792     1
7.1417      1
Name: Fare, Length: 281, dtype: int64

Embarked_C :
0    1039
1     270
Name: Embarked_C, dtype: int64

Embarked_Q :
0    1186
1     123
Name: Embarked_Q, dtype: int64

Embarked_S :
1    914
0    395
Name: Embarked_S, dtype: int64

Sex_male :
1    843
0    466
Name: Sex_male, dtype: int64

In [56]:
data=data.drop(['PassengerId'], axis=1)

In [57]:
data.head()

,Pclass,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S,Sex_male
0,3,22.0,1,0,7.2500,0,0,1,1
1,1,38.0,1,0,71.2833,1,0,0,0
2,3,26.0,0,0,7.9250,0,0,1,0
3,1,35.0,1,0,53.1000,0,0,1,0
4,3,35.0,0,0,8.0500,0,0,1,1

In [58]:
data_train = data.iloc[:891]
data_test = data.iloc[891:]

In [59]:
X = data_train.values
test = data_test.values
y = survived_train.values

In [60]:
# Instantiate model and fit to data
clf = tree.DecisionTreeClassifier(max_depth=3)
clf.fit(X, y)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=3,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [61]:
# Make predictions and store in 'Survived' column of df_test
Y_pred = clf.predict(test)
df_test['Survived'] = Y_pred

In [62]:
df_test[['PassengerId', 'Survived']].to_csv('/home/gajendra/Github/MachineLearning_intro/Titanic_data/predictions/2nd_solution.csv', index=False)